#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: README
#+DATE: <2020-03-29 Вс>
#+AUTHOR:
#+EMAIL: namatv@mnasoft-00
#+LANGUAGE: ru
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.3 (Org mode 9.1.9)


* Примеры использования
** Первый
#+BEGIN_SRC lisp
(progn
    (list
     (list (mdv:quantity 220 "V" 15 "A"))
     (list (mdv:quantity 220 :* "V" :* 15 :* "A"))
     (list (mdv:quantity 20 "kgf" :/ "cm" :/ "cm"))))
#+END_SRC

** Второй
#+BEGIN_SRC lisp
  (progn
    (in-package :mnas-dim-value)
    (list
     (mdv:quantity 101325 "Pa" :+ ( 2.0 mdv:|*g*| :/ (1 :* "cm" :* "cm")))
     (mdv:quantity 101325 "Pa" :+ ( 2.0 mdv:|*g*| :/ (1 :* "cm" :^ 2))) 
))
#+END_SRC

** Третий
#+BEGIN_SRC lisp
(progn
  (in-package :mnas-dim-value)
  (list (mnas-dim-value:quantity 1 "d" + 15 "h" 20 + "min" + 30.5 "s")))
#+END_SRC

#+name: foo
#+BEGIN_SRC lisp
(mdv:quantity-name (mdv:vd/ "N" (mdv:vd*  "cm" "cm")))
#+END_SRC

#+name: foo1
#+BEGIN_SRC lisp
(mdv:quantity-name (mdv:vd*  "cm" "cm"))
#+END_SRC

* [7/9] Задачи
1) [X] Добавить имена типов размерностей для данных, содержащихся в переменных
2) [X] Импортировать функции vd*, vd/, vd+, vd- в пакет :cl-user.
3) [X] Импортировать в пакет :cl-user значения размерностей, имеющих наименования.
4) [X] Исправить предупреждение в методе print-object ((x vd) o-s)
5) [X] Заменить defparameter на defvar в определении хеш таблиц
6) [X] Разбор выражения, заданного в виде строки
7) [X] Выбор множителей
   - [X] для таблицы 5;
   - [X] для таблицы 7.
8) [3/4] Добавить документацию
   - [X] подключить CODEX; 
   - [X] подключить annot; 
   - [ ] к функциям;
   - [X] к классам;
9) [1/4] Печать класса vd
   - [X] Печать класса vd с разделителями;
   - [ ] Печать класса vd с диапазоном значений от 0.1 до 1000;
   - [ ] Печать класса vd в html формат;
   - [ ] Печать в виде суммы величин.
     - Например: время c -> (+ д ч мин с) => 15 д 9 ч 25 мин 50 с
10) [0/1] Разобраться с безразмерными величинами
    - [ ] На настоящий момент образуются безразмерные величины с множительными приставками. Например Gul, Mul, kul=1000 ul. Лучше, чтобы образовывалась только одна безразмерная единица без множительной приставки.
11) [ ] Диалоговая программа ввода данных
12) [ ] Консольная интерактивная программа с возможностями:
    - [ ] присвоения значения переменным;
    - [ ] загрузки выражений из файла (человеко-читаемого);
    - [ ] выгрузка выражений в файл (человеко-читаемый);
    - [ ] написания функций.
* defun
* defparameter

#+RESULTS:
| MNAS-DIM-VALUE::*SI-MAIN-UNITS*              | Задает основные единицы измерения системы SI; Каждый подсписок состоит из следующих элементов:; @begin(enum); @item(английксое наименование величины;); @item(русское наименование величины;); @item(размерность величины;); @item(английское наименование единицы;); @item(русское наименование единицы;); @item(международное обозначение единицы;); @item(русское обозначение единицы.); @end(enum); см. ГОСТ 8.417-2002, таблица 1                                                                                             |
| MNAS-DIM-VALUE::*SI-DERIVED-UNITS-TBL-02*    | Производные единицы СИ, наименования и обозначения которых образованы с использованием;  наименований и обозначений основных единиц СИ.; Каждый подсписок состоит из следующих элементов:; 1 - английское наименование величины; 2 - русское наименование величины; 3 - размерность; 4 - международное обозначение единицы; см. ГОСТ 8.417-2002 таблица 2                                                                                                                                                                          |
| MNAS-DIM-VALUE::*SI-DERIVED-UNITS-TBL-03*    | Задает производные единицы СИ, имефщие специальные наименование и обозначения; Каждый подсписок состоит из следующих элементов:; 1 - международное наименование величины; 2 - русское наименование величины; 3 - размерность; 4 - международное наименование единицы; 5 - русское наименование единицы; 6 - международное обозначение единицы; 7 - русское обозначение единицы; 8 - размерность, выраженная в других единицах системы Си; 9 - размерность, выраженная в основны единицах системы Си; см. ГОСТ 8.417-2002 таблица 3 |
| MNAS-DIM-VALUE::*SI-DERIVED-UNITS-TBL-04*    | Задает производные единицы измерения системы SI; Каждый подсписок состоит из следующих элементов:; 1 - английское наименование величины; 2 - русское наименование величины; 3 - размерность величины; 4 - международное обозначене единицы; 5 - единицы, вараженная через основные и производные единицы СИ; см. ГОСТ 8.417-2002, таблица 4                                                                                                                                                                                        |
| MNAS-DIM-VALUE::*NOT-SI-UNITS-TBL-05*        | Внесистемные единицы, допустимые к применению наравне с единицами СИ                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| MNAS-DIM-VALUE::*NOT-SI-UNITS-TBL-07*        | Внесистемные единицы, временно допустимые к применению                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| MNAS-DIM-VALUE::*OTHER-UNITS-TBL-B-01*       | Соотношение некоторых внесистемных единиц с единицами СИ                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| MNAS-DIM-VALUE::*ND-SI-MAIN-UNITS*           | Задает основные единицы измерения системы SI; Каждый подсписок состоит из следующих элементов:; @begin(enum); @item(английксое наименование величины;); @item(русское наименование величины;); @item(размерность величины;); @item(английское наименование единицы;); @item(русское наименование единицы;); @item(международное обозначение единицы;); @item(русское обозначение единицы.); @end(enum); см. ГОСТ 8.417-2002, таблица 1                                                                                             |
| MNAS-DIM-VALUE::*ND-SI-DERIVED-UNITS-TBL-02* | Производные единицы СИ, наименования и обозначения которых образованы с использованием;  наименований и обозначений основных единиц СИ.; Каждый подсписок состоит из следующих элементов:; 1 - английское наименование величины; 2 - русское наименование величины; 3 - размерность; 4 - международное обозначение единицы; см. ГОСТ 8.417-2002 таблица 2                                                                                                                                                                          |
| MNAS-DIM-VALUE::*ND-SI-DERIVED-UNITS-TBL-03* | Задает производные единицы СИ, имефщие специальные наименование и обозначения; Каждый подсписок состоит из следующих элементов:; 1 - международное наименование величины; 2 - русское наименование величины; 3 - размерность; 4 - международное наименование единицы; 5 - русское наименование единицы; 6 - международное обозначение единицы; 7 - русское обозначение единицы; 8 - размерность, выраженная в других единицах системы Си; 9 - размерность, выраженная в основны единицах системы Си; см. ГОСТ 8.417-2002 таблица 3 |
| MNAS-DIM-VALUE::*ND-SI-DERIVED-UNITS-TBL-04* | Задает производные единицы измерения системы SI; Каждый подсписок состоит из следующих элементов:; 1 - английское наименование величины; 2 - русское наименование величины; 3 - размерность величины; 4 - международное обозначене единицы; 5 - единицы, вараженная через основные и производные единицы СИ; см. ГОСТ 8.417-2002, таблица 4                                                                                                                                                                                        |
| MNAS-DIM-VALUE::*ND-NOT-SI-UNITS-TBL-05*     | Внесистемные единицы, допустимые к применению наравне с единицами СИ                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| MNAS-DIM-VALUE::*ND-NOT-SI-UNITS-TBL-07*     | Внесистемные единицы, временно допустимые к применению                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
* Данные таблиц
#+CAPTION: mnas-dim-value::*si-main-units*
#+RESULTS:
| dimensionless       | безразмерный                  | U | ul       | бр        | ul  | бр   |      1 | [ul]  |
| length              | длина                         | L | meter    | метр      | m   | м    |      1 | [m]   |
| mass                | масса                         | M | kilogram | килограмм | g   | г    | 1/1000 | [kg]  |
| time                | время                         | T | second   | секунда   | s   | с    |      1 | [s]   |
| electric current    | сила тока электрического      | I | ampere   | ампер     | A   | А    |      1 | [A]   |
| temperature         | температура термодинамическая | Θ | kelvin   | кельвин   | K   | К    |      1 | [K]   |
| amount of substance | количество вещества           | N | mole     | моль      | mol | моль |      1 | [mol] |
| luminous intensity  | сила света                    | J | candela  | кандела   | cd  | кд   |      1 | [cd]  |

#+CAPTION: mnas-dim-value::*si-derived-units-tbl-02*
#+RESULTS:
| area                    | площадь                          | NIL |   | квадратный метр              | m^2     | м^2      | 1 | [m^2]     |
| volume                  | объём                            | NIL |   | кубический метр              | m^3     | м^3      | 1 | [m^3]     |
| velocity                | скорость                         | NIL |   | метр в секунду               | m/s     | м/с      | 1 | [m/s]     |
| acceleration            | ускорение                        | NIL |   | метр на секунду в квадрате   | m/s^2   | м/с^2    | 1 | [m/s^2]   |
| wave number             | волновое число                   | NIL |   | метр в минус первой степени  | 1/m     | 1/м      | 1 | [1/m]     |
| (density mass density)  | плотность                        | NIL |   | килограмм на кубический метр | kg/m^3  | кг/м^3   | 1 | [kg/m^3]  |
| specific volume         | удельный объём                   | NIL |   | кубический метр на килограмм | m^3/kg  | м^3/кг   | 1 | [m^3/kg]  |
| current density         | плотность электрического тока    | NIL |   | ампер на квадратный метр     | A/m^2   | А/м^2    | 1 | [A/m^2]   |
| magnetic field strength | напряжённость магнитного поля    | NIL |   | ампер на метр                | A/m     | А/м      | 1 | [A/m]     |
| molar concentration     | молярная концентрация компонента | NIL |   | моль на кубический метр      | mol/m^3 | моль/м^3 | 1 | [mol/m^3] |
| luminance               | яркость                          | NIL |   | кандела на квадратный метр   | cd/m^2  | кд/м^2   | 1 | [cd/m^2]  |

#+CAPTION: mnas-dim-value::*si-derived-units-tbl-03*
#+RESULTS:
| plane angle                                                                                                          | плоский угол                                                                          | L/L     | radian         | радиан         | rad | рад | m^1*m^-1            | 1 | [rad] |
| solid angle                                                                                                          | телесный угол                                                                         | L^2/L^2 | steradian      | стерадиан      | sr  | ср  | m^2*m^-2=1          | 1 | [sr]  |
| frequency                                                                                                            | частота                                                                               | NIL     | hertz          | герц           | Hz  | Гц  | s^-1                | 1 | [Hz]  |
| force                                                                                                                | сила                                                                                  | NIL     | newton         | ньютон         | N   | Н   | m*kg*s^-2           | 1 | [N]   |
| pressure                                                                                                             | давление                                                                              | NIL     | pascal         | паскаль        | Pa  | Па  | m^-1*kg*s^-2        | 1 | [Pa]  |
| (energy work quantity of heat)                                                                                       | (энергия работа количество теплоты)                                                   | NIL     | joule          | джоуль         | J   | Дж  | kg*m^2/s^2          | 1 | [J]   |
| (power radiant flux)                                                                                                 | (мощность поток излучения)                                                            | NIL     | watt           | ватт           | W   | Вт  | kg*m^2/s^3          | 1 | [W]   |
| (electric charge quantity of electricity)                                                                            | (электрический заряд количество электричества)                                        | NIL     | coulomb        | кулон          | C   | Кл  | s*A                 | 1 | [C]   |
| (electric potential difference electromotive force)                                                                  | (электрическое напряжение электродвижущая сила)                                       | NIL     | volt           | вольт          | V   | В   | m^2*kg*s^-3*A^-1    | 1 | [V]   |
| capacitance                                                                                                          | электрическая ёмкость                                                                 | NIL     | farad          | фарад          | F   | Ф   | m^-2*kg^-1*s^4*A^2  | 1 | [F]   |
| electric resistance                                                                                                  | электрическое сопротивление                                                           | NIL     | ohm            | ом             | Ω   | Ом  | m^2*kg*s^-3*A^-2    | 1 | [Ω]   |
| electric conductance                                                                                                 | электрическая проводимость                                                            | NIL     | siemens        | сименс         | S   | См  | m^-2*kg^-1*s^3*A^2  | 1 | [S]   |
| magnetic flux                                                                                                        | магнитный поток                                                                       | NIL     | weber          | вебер          | Wb  | Вб  | m^2*kg*s^-2*A^-1    | 1 | [Wb]  |
| magnetic flux density                                                                                                | магнитная индукция                                                                    | NIL     | tesla          | тесла          | T   | Тл  | kg*s^-2*A^-1        | 1 | [T]   |
| inductance                                                                                                           | индуктивность                                                                         | NIL     | henry          | генри          | H   | Гн  | m^2*kg*s^-2*A^-2    | 1 | [H]   |
| Celsius temperature                                                                                                  | температура по Цельсию                                                                | NIL     | degree Celsius | градус Цельсия | °C  | °С  | K                   | 1 | [K]   |
| luminous flux                                                                                                        | световой поток                                                                        | NIL     | lumen          | люмен          | lm  | лм  | m^2*m^-2*cd=cd      | 1 | [lm]  |
| illuminance                                                                                                          | освещенность                                                                          | NIL     | lux            | люкс           | lx  | лк  | m^2*m^-4*cd=m^-2*cd | 1 | [lx]  |
| activity (referred to a radionuclide)                                                                                | активность (радионуклида)                                                             | NIL     | becquerel      | беккерель      | Bq  | Бк  | s^-1                | 1 | [Hz]  |
| (absorbed dose specific energy (imparted) kerma)                                                                     | (поглощенная доза излучения показатель поглощенной дозы керма)                        | NIL     | gray           | грей           | Gy  | Гр  | m^2*s^-2            | 1 | [Gy]  |
| (dose equivalent ambient dose equivalent directional dose equivalent personal dose equivalent organ equivalent dose) | (эквивалентная доза ионизирующего излучения эффективная доза ионизирующего излучения) | NIL     | sievert        | зиверт         | Sv  | Зв  | m^2*s^-2            | 1 | [Gy]  |
| catalytic activity                                                                                                   | активность катализатора                                                               | NIL     | katal          | катал          | kat | кат | s^-1*mol            | 1 | [kat] |

#+CAPTION: mnas-dim-value::*si-derived-units-tbl-04*
#+RESULTS:
| moment of force                           | момент силы                                      | NIL |   | ньютон-метр                     | N*m        | Н*м         | m^2*kg*s^-2             | 1 | [J]           |
| surface tension                           | поверхностное натяжение                          | NIL |   | ньютон-метр                     | N/m        | Н*м         | kg*s^-2                 | 1 | [N/m]         |
| dynamic viscosity                         | динамическая вязкость                            | NIL |   | паскаль-секунда                 | Pa*s       | Па*с        | m^-1*kg*s^-1            | 1 | [Pa*s]        |
| electric charge density                   | пространственная плотность электрического заряда | NIL |   | кулон на кубический метр        | C/m^3      | Кл/м^3      | m^-3*s*A                | 1 | [C/m^3]       |
| electric flux density                     | электрическое смещение                           | NIL |   | кулон на квадратный метр        | C/m^2      | Кл/м^2      | m^-2*s*A                | 1 | [C/m^2]       |
| electric field strength                   | напряженность электрического поля                | NIL |   | воль на метр                    | V/m        | В/м         | m*kg*s^-3*A^-1          | 1 | [V/m]         |
| permittivity                              | диэлектрическая проницаемость                    | NIL |   | фарад на метр                   | F/m        | Ф/м         | m^-3*kg-1*s^4*A^2       | 1 | [F/m]         |
| permeability                              | магнитная проницаемость                          | NIL |   | генри на метр                   | H/m        | Гн/м        | m*kg*s^-2*A^-2          | 1 | [H/m]         |
| specific energy                           | удельная энергия                                 | NIL |   | джоуль на килограмм             | J/kg       | Дж/кг       | m^2*s^-2                | 1 | [Gy]          |
| (heat capacity entropy)                   | (теплоемкость системы энтропия системы)          | NIL |   | джоуль на кельвин               | J/K        | Дж/К        | kg*m^2/(s^2*K)          | 1 | [J/K]         |
| (specific heat capacity specific entropy) | (удельная теплоёмкость удельная энтропия)        | NIL |   | джоуль на килограмм-кельвин     | J/(kg*K)   | Дж/(кг*К)   | m^2/(s^2*K)             | 1 | [J/ (kg*K)]   |
| (heat flux density irradiance)            | поверхностная плотность потока энергии           | NIL |   | ватт на квадратный метр         | W/m^2      | Вт/м^2      | kg*s^-3                 | 1 | [W/m^2]       |
| thermal conductivity                      | теплопроводность                                 | NIL |   | ватт на метр-кельвин            | W/(m*K)    | Вт/(м*К)    | m*kg*s^-3*K^-1          | 1 | [W/ (m*K)]    |
| molar energy                              | молярная внутренняя энергия                      | NIL |   | джоуль на моль                  | J/mol      | Дж/моль     | m^2*kg*s^-2*mol^-1      | 1 | [J/mol]       |
| (molar entropy molar heat capacity)       | (молярная энтропия молярная теплоёмкость)        | NIL |   | джоуль на моль-кельвин          | J/(mol*K)  | Дж/(моль*К) | m^2*kg*s^-2*K^-1*mol^-1 | 1 | [J/ (mol*K)]  |
| exposure (x and γ rays)                   | экспозиционная доза фотонного излучения          | NIL |   | кулон на килограмм              | C/kg       | Кл/кг       | kg^-1*s*A               | 1 | [C/kg]        |
| absorbed dose rate                        | мощность поглощённой дозы                        | NIL |   | грей в секунду                  | Gy/s       | Гр/с        | m^2*s^-3                | 1 | [Gy/s]        |
| angular velocity                          | угловая скорость                                 | NIL |   | радиан в секунду                | rad/s      | рад/с       | s^-1                    | 1 | [rad/s]       |
| angular acceleration                      | угловое ускорение                                | NIL |   | радиан на секунду в квадрате    | rad/s^2    | рад/с^2     | s^-2                    | 1 | [rad/s^2]     |
| radiant intensity                         | сила излучения                                   | NIL |   | ватт на стерадиан               | W/sr       | Вт/ср       | m^4*m^-2*kg*s^-3        | 1 | [W/sr]        |
| radiance                                  | энергетическая яркость                           | NIL |   | ватт на стерадан-кадратный метр | W/(sr*m^2) | Вт/(ср*м^2) | m^2*m^-2*kg*s^-3        | 1 | [W/ (sr*m^2)] |

#+CAPTION: mnas-dim-value::*not-si-units-tbl-05*
#+RESULTS:
| mass            | масса               | NIL | ton               | тонна                   | t    | т      |                   1000 | [kg]  | ((0 24))        |
| mass            | масса               | NIL |                   | атомная единица массы   | u    | а.е.м. |         1.66054021d-27 | [kg]  | ((-24 24))      |
| time            | время               | NIL | minute            | минута                  | min  | мин    |                     60 | [s]   | NIL             |
| time            | время               | NIL | hour              | час                     | h    | ч      |                   3600 | [s]   | NIL             |
| time            | время               | NIL | day               | сутки                   | d    | сут    |                  86400 | [s]   | NIL             |
| plane angle     | плоский угол        | NIL | degree            | градус                  | °    | °      | 0.017453292519943295d0 | [rad] | NIL             |
| plane angle     | плоский угол        | NIL | minute            | минута                  | '    | '      |   2.908882086657216d-4 | [rad] | NIL             |
| plane angle     | плоский угол        | NIL | second            | секунда                 | "    | "      |    4.84813681109536d-6 | [rad] | NIL             |
| plane angle     | плоский угол        | NIL | gon               | град                    | gon  | град   | 0.015707963267948967d0 | [rad] | NIL             |
| volume          | объём               | NIL | liter             | литр                    | l    | л      |                 1/1000 | [m^3] | ((-3 -3) (0 3)) |
| length          | длина               | NIL | astronomical unit | астрономическая единица | ua   | а.е.   |      1.495978706916d11 | [m]   | NIL             |
| length          | длина               | NIL | light year        | световой год            | ly   | св.год |     9.4607304725808d15 | [m]   | NIL             |
| length          | длина               | NIL | parsec            | парсек                  | pc   | пк     |           3.0856776d16 | [m]   | NIL             |
| optical force   | оптическая сила     | NIL |                   | диоптрия                | дптр | дптр   |                      1 | [1/m] | NIL             |
| area            | площадь             | NIL | hectare           | гектар                  | ha   | га     |                  10000 | [m^2] | NIL             |
| area            | площадь             | NIL | are               | aр                      | a    | а      |                    100 | [m^2] | NIL             |
| energy          | энергия             | NIL | electron-volt     | электрон-вольт          | eV   | эВ     |         1.60217733d-19 | [J]   | NIL             |
| energy          | энергия             | NIL | kilowatt-hour     | киловатт-час            | kW*h | кВт*ч  |                3600000 | [J]   | NIL             |
| full power      | полная мощность     | NIL | volt-ampere       | вольт-ампер             | V*A  | В*А    |                      1 | [W]   | NIL             |
| reactive power  | рекативная мощность | NIL | var               | вар                     | var  | вар    |                      1 | [W]   | NIL             |
| electric charge | электрический заряд | NIL | ampere hour       | ампер-час               | A*h  | А*ч    |                   3600 | [C]   | NIL             |

#+CAPTION: mnas-dim-value::*not-si-units-tbl-07*
#+RESULTS:
| length           | длина              | NIL | nautical mile | морская миля     | nmi   | миля   |                  1852 | [m]     | NIL |
| mass             | масса              | NIL |               | карат            | кар   | кар    |                1/5000 | [kg]    | NIL |
| linear density   | линейная плотность | NIL |               | текс             | tex   | текс   |             1/1000000 | [kg/m]  | NIL |
| velocity         | скорость           | NIL | knot          | узел             | kn    | уз     |               463/900 | [m*s]   | NIL |
| acceleration     | ускорение          | NIL |               | гал              | Gal   | Гал    |                 1/100 | [m/s^2] | NIL |
| rotational speed | частота вращения   | NIL |               | оборот в секунду | r/s   | об/с   |   6.283185307179586d0 | [rad/s] | NIL |
| rotational speed | частота вращения   | NIL |               | оборот в минуту  | r/min | об/мин | 0.10471975511965977d0 | [rad/s] | NIL |
| pressure         | давление           | NIL |               | бар              | bar   | бар    |                100000 | [Pa]    | NIL |

#+CAPTION: mnas-dim-value::*other-units-tbl-b-01*
#+RESULTS:
| length                         | длина                                           | NIL | angstrom      | ангстрем                               | Å        | Å          |               1.0d-10 | [m]     | NIL        |
| area                           | площадь                                         | NIL | barn          | барн                                   | b        | б          |               1.0d-28 | [m^2]   | NIL        |
| mass                           | масса                                           | NIL |               | центнер                                | q        | ц          |                   100 | [kg]    | NIL        |
| solid angle                    | телесный угол                                   | NIL | square degree | квадратный градус                      | □˚       | □˚         | 3.0461741978670857d-4 | [sr]    | NIL        |
| force                          | сила                                            | NIL |               | дина                                   | dyn      | дин        |              1/100000 | [N]     | NIL        |
| force                          | сила                                            | NIL |               | килограмм-сила                         | kgf      | кгс        |              9.8065d0 | [N]     | NIL        |
| force                          | сила                                            | NIL |               | килопонд                               | kp       | kp         |              9.8065d0 | [N]     | NIL        |
| force                          | сила                                            | NIL |               | грамм-сила                             | gf       | гс         |           0.0098065d0 | [N]     | ((-24 3))  |
| force                          | сила                                            | NIL |               | понд                                   | p        | p          |              9.8065d0 | [N]     | ((-24 24)) |
| force                          | сила                                            | NIL |               | тонна-сила                             | tf       | тс         |              9806.5d0 | [N]     | ((0 24))   |
| pressure                       | давление                                        | NIL |               | килограмм-сила на квадратный сантиметр | kgf/cm^2 | кгс/см^2   |             98065.0d0 | [Pa]    | NIL        |
| pressure                       | давление                                        | NIL |               | килопонд на квадратный сантиметр       | kp/cm^2  | kp/cm^2    |             98065.0d0 | [Pa]    | NIL        |
| pressure                       | давление                                        | NIL |               | метр водяного столба                   | m_H2O    | м вод. ст. |               9806.65 | [Pa]    | ((-3 24))  |
| pressure                       | давление                                        | NIL |               | метр ртутного столба                   | m_Hg     | м_pт._ст.  |            133322.0d0 | [Pa]    | ((-3 24))  |
| pressure                       | давление                                        | NIL |               | торр                                   | Torr     | Торр       |             133.322d0 | [Pa]    | ((-24 24)) |
| stress                         | напряжение                                      | NIL |               | килограмм-сила на квадратный миллиметр | kgf/mm^2 | кгс/мм^2   |           9806500.0d0 | [Pa]    | NIL        |
| stress                         | напряжение                                      | NIL |               | килопонд на квадратный миллиметр       | kp/mm^2  | -          |           9806500.0d0 | [Pa]    | NIL        |
| (energy work quantity of heat) | (работа энергия)                                | NIL |               | эрг                                    | erg      | эрг        |            1/10000000 | [J]     | ((-24 24)) |
| power                          | мощность                                        | NIL | horsepower    | лошадиная сила                         | hp       | л.с.       |            735.4875d0 | [W]     | NIL        |
| kinematic viscosity            | динамическая вязкость                           | NIL |               | пуаз                                   | P        | П          |                  1/10 | [Pa*s]  | ((-24 24)) |
| kinematic viscosity            | кинематическая вязкость                         | NIL |               | стокс                                  | St       | Ст         |               1/10000 | [m^2/s] | ((24 24))  |
| quantity of heat               | (количество теплоты термодинамический потециал) | NIL |               | калория                                | cal      | кал        |                4.1868 | [J]     | ((-24 24)) |
| quantity of heat               | (количество теплоты термодинамический потециал) | NIL |               | калория термохимическая                | cal_{th} | кал_{тх}   |                 4.184 | [J]     | ((-24 24)) |
| heat of chemical reaction      | (теплота химической рекции)                     | NIL |               | калория  15-градусная                  | cal_{15} | кал_{15}   |                4.1855 | [J]     | ((-24 24)) |
| length                         | длина                                           | NIL |               | микрон                                 | μ        | мк         |             1/1000000 | [m]     | NIL        |
| angle of rotation              | угол поворота                                   | NIL |               | оборот                                 | r        | об         |   6.283185307179586d0 | [rad]   | NIL        |
| area                           | площадь                                         | NIL |               | ар                                     | a        | а          |                   100 | [m^2]   | ((0 2))    |

#+RESULTS:
| Q-N-EN | dimensionless       | Q-N-RU | безразмерный                  | U-N-EN | ul       | U-N-RU | бр        | U-S-EN | ul  | U-S-RU | бр   | D-SYMB | U | VALUE |      1 | [ul]  | COEFF | ((-24 24)) |
| Q-N-EN | length              | Q-N-RU | длина                         | U-N-EN | meter    | U-N-RU | метр      | U-S-EN | m   | U-S-RU | м    | D-SYMB | L | VALUE |      1 | [m]   | COEFF | ((-24 24)) |
| Q-N-EN | mass                | Q-N-RU | масса                         | U-N-EN | kilogram | U-N-RU | килограмм | U-S-EN | g   | U-S-RU | г    | D-SYMB | M | VALUE | 1/1000 | [kg]  | COEFF | ((-24 24)) |
| Q-N-EN | time                | Q-N-RU | время                         | U-N-EN | second   | U-N-RU | секунда   | U-S-EN | s   | U-S-RU | с    | D-SYMB | T | VALUE |      1 | [s]   | COEFF | ((-24 24)) |
| Q-N-EN | electric current    | Q-N-RU | сила тока электрического      | U-N-EN | ampere   | U-N-RU | ампер     | U-S-EN | A   | U-S-RU | А    | D-SYMB | I | VALUE |      1 | [A]   | COEFF | ((-24 24)) |
| Q-N-EN | temperature         | Q-N-RU | температура термодинамическая | U-N-EN | kelvin   | U-N-RU | кельвин   | U-S-EN | K   | U-S-RU | К    | D-SYMB | Θ | VALUE |      1 | [K]   | COEFF | ((-24 24)) |
| Q-N-EN | amount of substance | Q-N-RU | количество вещества           | U-N-EN | mole     | U-N-RU | моль      | U-S-EN | mol | U-S-RU | моль | D-SYMB | N | VALUE |      1 | [mol] | COEFF | ((-24 24)) |
| Q-N-EN | luminous intensity  | Q-N-RU | сила света                    | U-N-EN | candela  | U-N-RU | кандела   | U-S-EN | cd  | U-S-RU | кд   | D-SYMB | J | VALUE |      1 | [cd]  | COEFF | ((-24 24)) |


#+RESULTS:
| Q-N-EN | area                    | Q-N-RU | площадь                          | U-N-EN |   | U-N-RU | квадратный метр              | U-S-EN | m^2     | U-S-RU | м^2      | D-SYMB | NIL | VALUE | 1 | [m^2]     | COEFF | ((-24 24)) |
| Q-N-EN | volume                  | Q-N-RU | объём                            | U-N-EN |   | U-N-RU | кубический метр              | U-S-EN | m^3     | U-S-RU | м^3      | D-SYMB | NIL | VALUE | 1 | [m^3]     | COEFF | ((-24 24)) |
| Q-N-EN | velocity                | Q-N-RU | скорость                         | U-N-EN |   | U-N-RU | метр в секунду               | U-S-EN | m/s     | U-S-RU | м/с      | D-SYMB | NIL | VALUE | 1 | [m/s]     | COEFF | ((-24 24)) |
| Q-N-EN | acceleration            | Q-N-RU | ускорение                        | U-N-EN |   | U-N-RU | метр на секунду в квадрате   | U-S-EN | m/s^2   | U-S-RU | м/с^2    | D-SYMB | NIL | VALUE | 1 | [m/s^2]   | COEFF | ((-24 24)) |
| Q-N-EN | wave number             | Q-N-RU | волновое число                   | U-N-EN |   | U-N-RU | метр в минус первой степени  | U-S-EN | 1/m     | U-S-RU | 1/м      | D-SYMB | NIL | VALUE | 1 | [1/m]     | COEFF | ((-24 24)) |
| Q-N-EN | (density mass density)  | Q-N-RU | плотность                        | U-N-EN |   | U-N-RU | килограмм на кубический метр | U-S-EN | kg/m^3  | U-S-RU | кг/м^3   | D-SYMB | NIL | VALUE | 1 | [kg/m^3]  | COEFF | ((-24 24)) |
| Q-N-EN | specific volume         | Q-N-RU | удельный объём                   | U-N-EN |   | U-N-RU | кубический метр на килограмм | U-S-EN | m^3/kg  | U-S-RU | м^3/кг   | D-SYMB | NIL | VALUE | 1 | [m^3/kg]  | COEFF | ((-24 24)) |
| Q-N-EN | current density         | Q-N-RU | плотность электрического тока    | U-N-EN |   | U-N-RU | ампер на квадратный метр     | U-S-EN | A/m^2   | U-S-RU | А/м^2    | D-SYMB | NIL | VALUE | 1 | [A/m^2]   | COEFF | ((-24 24)) |
| Q-N-EN | magnetic field strength | Q-N-RU | напряжённость магнитного поля    | U-N-EN |   | U-N-RU | ампер на метр                | U-S-EN | A/m     | U-S-RU | А/м      | D-SYMB | NIL | VALUE | 1 | [A/m]     | COEFF | ((-24 24)) |
| Q-N-EN | molar concentration     | Q-N-RU | молярная концентрация компонента | U-N-EN |   | U-N-RU | моль на кубический метр      | U-S-EN | mol/m^3 | U-S-RU | моль/м^3 | D-SYMB | NIL | VALUE | 1 | [mol/m^3] | COEFF | ((-24 24)) |
| Q-N-EN | luminance               | Q-N-RU | яркость                          | U-N-EN |   | U-N-RU | кандела на квадратный метр   | U-S-EN | cd/m^2  | U-S-RU | кд/м^2   | D-SYMB | NIL | VALUE | 1 | [cd/m^2]  | COEFF | ((-24 24)) |

#+RESULTS:
| Q-N-EN | plane angle                                                                                                          | Q-N-RU | плоский угол                                                                          | U-N-EN | radian         | U-N-RU | радиан         | U-S-EN | rad | U-S-RU | рад | D-SYMB | L/L     | VALUE | 1 | [rad] | COEFF | ((-24 24)) |
| Q-N-EN | solid angle                                                                                                          | Q-N-RU | телесный угол                                                                         | U-N-EN | steradian      | U-N-RU | стерадиан      | U-S-EN | sr  | U-S-RU | ср  | D-SYMB | L^2/L^2 | VALUE | 1 | [sr]  | COEFF | ((-24 24)) |
| Q-N-EN | frequency                                                                                                            | Q-N-RU | частота                                                                               | U-N-EN | hertz          | U-N-RU | герц           | U-S-EN | Hz  | U-S-RU | Гц  | D-SYMB | NIL     | VALUE | 1 | [Hz]  | COEFF | ((-24 24)) |
| Q-N-EN | force                                                                                                                | Q-N-RU | сила                                                                                  | U-N-EN | newton         | U-N-RU | ньютон         | U-S-EN | N   | U-S-RU | Н   | D-SYMB | NIL     | VALUE | 1 | [N]   | COEFF | ((-24 24)) |
| Q-N-EN | pressure                                                                                                             | Q-N-RU | давление                                                                              | U-N-EN | pascal         | U-N-RU | паскаль        | U-S-EN | Pa  | U-S-RU | Па  | D-SYMB | NIL     | VALUE | 1 | [Pa]  | COEFF | ((-24 24)) |
| Q-N-EN | (energy work quantity of heat)                                                                                       | Q-N-RU | (энергия работа количество теплоты)                                                   | U-N-EN | joule          | U-N-RU | джоуль         | U-S-EN | J   | U-S-RU | Дж  | D-SYMB | NIL     | VALUE | 1 | [J]   | COEFF | ((-24 24)) |
| Q-N-EN | (power radiant flux)                                                                                                 | Q-N-RU | (мощность поток излучения)                                                            | U-N-EN | watt           | U-N-RU | ватт           | U-S-EN | W   | U-S-RU | Вт  | D-SYMB | NIL     | VALUE | 1 | [W]   | COEFF | ((-24 24)) |
| Q-N-EN | (electric charge quantity of electricity)                                                                            | Q-N-RU | (электрический заряд количество электричества)                                        | U-N-EN | coulomb        | U-N-RU | кулон          | U-S-EN | C   | U-S-RU | Кл  | D-SYMB | NIL     | VALUE | 1 | [C]   | COEFF | ((-24 24)) |
| Q-N-EN | (electric potential difference electromotive force)                                                                  | Q-N-RU | (электрическое напряжение электродвижущая сила)                                       | U-N-EN | volt           | U-N-RU | вольт          | U-S-EN | V   | U-S-RU | В   | D-SYMB | NIL     | VALUE | 1 | [V]   | COEFF | ((-24 24)) |
| Q-N-EN | capacitance                                                                                                          | Q-N-RU | электрическая ёмкость                                                                 | U-N-EN | farad          | U-N-RU | фарад          | U-S-EN | F   | U-S-RU | Ф   | D-SYMB | NIL     | VALUE | 1 | [F]   | COEFF | ((-24 24)) |
| Q-N-EN | electric resistance                                                                                                  | Q-N-RU | электрическое сопротивление                                                           | U-N-EN | ohm            | U-N-RU | ом             | U-S-EN | Ω   | U-S-RU | Ом  | D-SYMB | NIL     | VALUE | 1 | [Ω]   | COEFF | ((-24 24)) |
| Q-N-EN | electric conductance                                                                                                 | Q-N-RU | электрическая проводимость                                                            | U-N-EN | siemens        | U-N-RU | сименс         | U-S-EN | S   | U-S-RU | См  | D-SYMB | NIL     | VALUE | 1 | [S]   | COEFF | ((-24 24)) |
| Q-N-EN | magnetic flux                                                                                                        | Q-N-RU | магнитный поток                                                                       | U-N-EN | weber          | U-N-RU | вебер          | U-S-EN | Wb  | U-S-RU | Вб  | D-SYMB | NIL     | VALUE | 1 | [Wb]  | COEFF | ((-24 24)) |
| Q-N-EN | magnetic flux density                                                                                                | Q-N-RU | магнитная индукция                                                                    | U-N-EN | tesla          | U-N-RU | тесла          | U-S-EN | T   | U-S-RU | Тл  | D-SYMB | NIL     | VALUE | 1 | [T]   | COEFF | ((-24 24)) |
| Q-N-EN | inductance                                                                                                           | Q-N-RU | индуктивность                                                                         | U-N-EN | henry          | U-N-RU | генри          | U-S-EN | H   | U-S-RU | Гн  | D-SYMB | NIL     | VALUE | 1 | [H]   | COEFF | ((-24 24)) |
| Q-N-EN | Celsius temperature                                                                                                  | Q-N-RU | температура по Цельсию                                                                | U-N-EN | degree Celsius | U-N-RU | градус Цельсия | U-S-EN | °C  | U-S-RU | °С  | D-SYMB | NIL     | VALUE | 1 | [K]   | COEFF | ((-24 24)) |
| Q-N-EN | luminous flux                                                                                                        | Q-N-RU | световой поток                                                                        | U-N-EN | lumen          | U-N-RU | люмен          | U-S-EN | lm  | U-S-RU | лм  | D-SYMB | NIL     | VALUE | 1 | [lm]  | COEFF | ((-24 24)) |
| Q-N-EN | illuminance                                                                                                          | Q-N-RU | освещенность                                                                          | U-N-EN | lux            | U-N-RU | люкс           | U-S-EN | lx  | U-S-RU | лк  | D-SYMB | NIL     | VALUE | 1 | [lx]  | COEFF | ((-24 24)) |
| Q-N-EN | activity (referred to a radionuclide)                                                                                | Q-N-RU | активность (радионуклида)                                                             | U-N-EN | becquerel      | U-N-RU | беккерель      | U-S-EN | Bq  | U-S-RU | Бк  | D-SYMB | NIL     | VALUE | 1 | [Hz]  | COEFF | ((-24 24)) |
| Q-N-EN | (absorbed dose specific energy (imparted) kerma)                                                                     | Q-N-RU | (поглощенная доза излучения показатель поглощенной дозы керма)                        | U-N-EN | gray           | U-N-RU | грей           | U-S-EN | Gy  | U-S-RU | Гр  | D-SYMB | NIL     | VALUE | 1 | [Gy]  | COEFF | ((-24 24)) |
| Q-N-EN | (dose equivalent ambient dose equivalent directional dose equivalent personal dose equivalent organ equivalent dose) | Q-N-RU | (эквивалентная доза ионизирующего излучения эффективная доза ионизирующего излучения) | U-N-EN | sievert        | U-N-RU | зиверт         | U-S-EN | Sv  | U-S-RU | Зв  | D-SYMB | NIL     | VALUE | 1 | [Gy]  | COEFF | ((-24 24)) |
| Q-N-EN | catalytic activity                                                                                                   | Q-N-RU | активность катализатора                                                               | U-N-EN | katal          | U-N-RU | катал          | U-S-EN | kat | U-S-RU | кат | D-SYMB | NIL     | VALUE | 1 | [kat] | COEFF | ((-24 24)) |

#+RESULTS:
| Q-N-EN | moment of force                           | Q-N-RU | момент силы                                      | U-N-EN |   | U-N-RU | ньютон-метр                     | U-S-EN | N*m        | U-S-RU | Н*м         | D-SYMB | NIL | VALUE | 1 | [J]           | COEFF | ((-24 24)) |
| Q-N-EN | surface tension                           | Q-N-RU | поверхностное натяжение                          | U-N-EN |   | U-N-RU | ньютон-метр                     | U-S-EN | N/m        | U-S-RU | Н*м         | D-SYMB | NIL | VALUE | 1 | [N/m]         | COEFF | ((-24 24)) |
| Q-N-EN | dynamic viscosity                         | Q-N-RU | динамическая вязкость                            | U-N-EN |   | U-N-RU | паскаль-секунда                 | U-S-EN | Pa*s       | U-S-RU | Па*с        | D-SYMB | NIL | VALUE | 1 | [Pa*s]        | COEFF | ((-24 24)) |
| Q-N-EN | electric charge density                   | Q-N-RU | пространственная плотность электрического заряда | U-N-EN |   | U-N-RU | кулон на кубический метр        | U-S-EN | C/m^3      | U-S-RU | Кл/м^3      | D-SYMB | NIL | VALUE | 1 | [C/m^3]       | COEFF | ((-24 24)) |
| Q-N-EN | electric flux density                     | Q-N-RU | электрическое смещение                           | U-N-EN |   | U-N-RU | кулон на квадратный метр        | U-S-EN | C/m^2      | U-S-RU | Кл/м^2      | D-SYMB | NIL | VALUE | 1 | [C/m^2]       | COEFF | ((-24 24)) |
| Q-N-EN | electric field strength                   | Q-N-RU | напряженность электрического поля                | U-N-EN |   | U-N-RU | воль на метр                    | U-S-EN | V/m        | U-S-RU | В/м         | D-SYMB | NIL | VALUE | 1 | [V/m]         | COEFF | ((-24 24)) |
| Q-N-EN | permittivity                              | Q-N-RU | диэлектрическая проницаемость                    | U-N-EN |   | U-N-RU | фарад на метр                   | U-S-EN | F/m        | U-S-RU | Ф/м         | D-SYMB | NIL | VALUE | 1 | [F/m]         | COEFF | ((-24 24)) |
| Q-N-EN | permeability                              | Q-N-RU | магнитная проницаемость                          | U-N-EN |   | U-N-RU | генри на метр                   | U-S-EN | H/m        | U-S-RU | Гн/м        | D-SYMB | NIL | VALUE | 1 | [H/m]         | COEFF | ((-24 24)) |
| Q-N-EN | specific energy                           | Q-N-RU | удельная энергия                                 | U-N-EN |   | U-N-RU | джоуль на килограмм             | U-S-EN | J/kg       | U-S-RU | Дж/кг       | D-SYMB | NIL | VALUE | 1 | [Gy]          | COEFF | ((-24 24)) |
| Q-N-EN | (heat capacity entropy)                   | Q-N-RU | (теплоемкость системы энтропия системы)          | U-N-EN |   | U-N-RU | джоуль на кельвин               | U-S-EN | J/K        | U-S-RU | Дж/К        | D-SYMB | NIL | VALUE | 1 | [J/K]         | COEFF | ((-24 24)) |
| Q-N-EN | (specific heat capacity specific entropy) | Q-N-RU | (удельная теплоёмкость удельная энтропия)        | U-N-EN |   | U-N-RU | джоуль на килограмм-кельвин     | U-S-EN | J/(kg*K)   | U-S-RU | Дж/(кг*К)   | D-SYMB | NIL | VALUE | 1 | [J/ (kg*K)]   | COEFF | ((-24 24)) |
| Q-N-EN | (heat flux density irradiance)            | Q-N-RU | поверхностная плотность потока энергии           | U-N-EN |   | U-N-RU | ватт на квадратный метр         | U-S-EN | W/m^2      | U-S-RU | Вт/м^2      | D-SYMB | NIL | VALUE | 1 | [W/m^2]       | COEFF | ((-24 24)) |
| Q-N-EN | thermal conductivity                      | Q-N-RU | теплопроводность                                 | U-N-EN |   | U-N-RU | ватт на метр-кельвин            | U-S-EN | W/(m*K)    | U-S-RU | Вт/(м*К)    | D-SYMB | NIL | VALUE | 1 | [W/ (m*K)]    | COEFF | ((-24 24)) |
| Q-N-EN | molar energy                              | Q-N-RU | молярная внутренняя энергия                      | U-N-EN |   | U-N-RU | джоуль на моль                  | U-S-EN | J/mol      | U-S-RU | Дж/моль     | D-SYMB | NIL | VALUE | 1 | [J/mol]       | COEFF | ((-24 24)) |
| Q-N-EN | (molar entropy molar heat capacity)       | Q-N-RU | (молярная энтропия молярная теплоёмкость)        | U-N-EN |   | U-N-RU | джоуль на моль-кельвин          | U-S-EN | J/(mol*K)  | U-S-RU | Дж/(моль*К) | D-SYMB | NIL | VALUE | 1 | [J/ (mol*K)]  | COEFF | ((-24 24)) |
| Q-N-EN | exposure (x and γ rays)                   | Q-N-RU | экспозиционная доза фотонного излучения          | U-N-EN |   | U-N-RU | кулон на килограмм              | U-S-EN | C/kg       | U-S-RU | Кл/кг       | D-SYMB | NIL | VALUE | 1 | [C/kg]        | COEFF | ((-24 24)) |
| Q-N-EN | absorbed dose rate                        | Q-N-RU | мощность поглощённой дозы                        | U-N-EN |   | U-N-RU | грей в секунду                  | U-S-EN | Gy/s       | U-S-RU | Гр/с        | D-SYMB | NIL | VALUE | 1 | [Gy/s]        | COEFF | ((-24 24)) |
| Q-N-EN | angular velocity                          | Q-N-RU | угловая скорость                                 | U-N-EN |   | U-N-RU | радиан в секунду                | U-S-EN | rad/s      | U-S-RU | рад/с       | D-SYMB | NIL | VALUE | 1 | [rad/s]       | COEFF | ((-24 24)) |
| Q-N-EN | angular acceleration                      | Q-N-RU | угловое ускорение                                | U-N-EN |   | U-N-RU | радиан на секунду в квадрате    | U-S-EN | rad/s^2    | U-S-RU | рад/с^2     | D-SYMB | NIL | VALUE | 1 | [rad/s^2]     | COEFF | ((-24 24)) |
| Q-N-EN | radiant intensity                         | Q-N-RU | сила излучения                                   | U-N-EN |   | U-N-RU | ватт на стерадиан               | U-S-EN | W/sr       | U-S-RU | Вт/ср       | D-SYMB | NIL | VALUE | 1 | [W/sr]        | COEFF | ((-24 24)) |
| Q-N-EN | radiance                                  | Q-N-RU | энергетическая яркость                           | U-N-EN |   | U-N-RU | ватт на стерадан-кадратный метр | U-S-EN | W/(sr*m^2) | U-S-RU | Вт/(ср*м^2) | D-SYMB | NIL | VALUE | 1 | [W/ (sr*m^2)] | COEFF | ((-24 24)) |

#+RESULTS:
| Q-N-EN | mass            | Q-N-RU | масса               | U-N-EN | ton               | U-N-RU | тонна                   | U-S-EN | t    | U-S-RU | т      | D-SYMB | NIL | VALUE |                   1000 | [kg]  | COEFF | ((0 24))        |
| Q-N-EN | mass            | Q-N-RU | масса               | U-N-EN |                   | U-N-RU | атомная единица массы   | U-S-EN | u    | U-S-RU | а.е.м. | D-SYMB | NIL | VALUE |         1.66054021d-27 | [kg]  | COEFF | ((-24 24))      |
| Q-N-EN | time            | Q-N-RU | время               | U-N-EN | minute            | U-N-RU | минута                  | U-S-EN | min  | U-S-RU | мин    | D-SYMB | NIL | VALUE |                     60 | [s]   | COEFF | NIL             |
| Q-N-EN | time            | Q-N-RU | время               | U-N-EN | hour              | U-N-RU | час                     | U-S-EN | h    | U-S-RU | ч      | D-SYMB | NIL | VALUE |                   3600 | [s]   | COEFF | NIL             |
| Q-N-EN | time            | Q-N-RU | время               | U-N-EN | day               | U-N-RU | сутки                   | U-S-EN | d    | U-S-RU | сут    | D-SYMB | NIL | VALUE |                  86400 | [s]   | COEFF | NIL             |
| Q-N-EN | plane angle     | Q-N-RU | плоский угол        | U-N-EN | degree            | U-N-RU | градус                  | U-S-EN | °    | U-S-RU | °      | D-SYMB | NIL | VALUE | 0.017453292519943295d0 | [rad] | COEFF | NIL             |
| Q-N-EN | plane angle     | Q-N-RU | плоский угол        | U-N-EN | minute            | U-N-RU | минута                  | U-S-EN | '    | U-S-RU | '      | D-SYMB | NIL | VALUE |   2.908882086657216d-4 | [rad] | COEFF | NIL             |
| Q-N-EN | plane angle     | Q-N-RU | плоский угол        | U-N-EN | second            | U-N-RU | секунда                 | U-S-EN | "    | U-S-RU | "      | D-SYMB | NIL | VALUE |    4.84813681109536d-6 | [rad] | COEFF | NIL             |
| Q-N-EN | plane angle     | Q-N-RU | плоский угол        | U-N-EN | gon               | U-N-RU | град                    | U-S-EN | gon  | U-S-RU | град   | D-SYMB | NIL | VALUE | 0.015707963267948967d0 | [rad] | COEFF | NIL             |
| Q-N-EN | volume          | Q-N-RU | объём               | U-N-EN | liter             | U-N-RU | литр                    | U-S-EN | l    | U-S-RU | л      | D-SYMB | NIL | VALUE |                 1/1000 | [m^3] | COEFF | ((-3 -3) (0 3)) |
| Q-N-EN | length          | Q-N-RU | длина               | U-N-EN | astronomical unit | U-N-RU | астрономическая единица | U-S-EN | ua   | U-S-RU | а.е.   | D-SYMB | NIL | VALUE |      1.495978706916d11 | [m]   | COEFF | NIL             |
| Q-N-EN | length          | Q-N-RU | длина               | U-N-EN | light year        | U-N-RU | световой год            | U-S-EN | ly   | U-S-RU | св.год | D-SYMB | NIL | VALUE |     9.4607304725808d15 | [m]   | COEFF | NIL             |
| Q-N-EN | length          | Q-N-RU | длина               | U-N-EN | parsec            | U-N-RU | парсек                  | U-S-EN | pc   | U-S-RU | пк     | D-SYMB | NIL | VALUE |           3.0856776d16 | [m]   | COEFF | NIL             |
| Q-N-EN | optical force   | Q-N-RU | оптическая сила     | U-N-EN |                   | U-N-RU | диоптрия                | U-S-EN | дптр | U-S-RU | дптр   | D-SYMB | NIL | VALUE |                      1 | [1/m] | COEFF | NIL             |
| Q-N-EN | area            | Q-N-RU | площадь             | U-N-EN | hectare           | U-N-RU | гектар                  | U-S-EN | ha   | U-S-RU | га     | D-SYMB | NIL | VALUE |                  10000 | [m^2] | COEFF | NIL             |
| Q-N-EN | area            | Q-N-RU | площадь             | U-N-EN | are               | U-N-RU | aр                      | U-S-EN | a    | U-S-RU | а      | D-SYMB | NIL | VALUE |                    100 | [m^2] | COEFF | NIL             |
| Q-N-EN | energy          | Q-N-RU | энергия             | U-N-EN | electron-volt     | U-N-RU | электрон-вольт          | U-S-EN | eV   | U-S-RU | эВ     | D-SYMB | NIL | VALUE |         1.60217733d-19 | [J]   | COEFF | NIL             |
| Q-N-EN | energy          | Q-N-RU | энергия             | U-N-EN | kilowatt-hour     | U-N-RU | киловатт-час            | U-S-EN | kW*h | U-S-RU | кВт*ч  | D-SYMB | NIL | VALUE |                3600000 | [J]   | COEFF | NIL             |
| Q-N-EN | full power      | Q-N-RU | полная мощность     | U-N-EN | volt-ampere       | U-N-RU | вольт-ампер             | U-S-EN | V*A  | U-S-RU | В*А    | D-SYMB | NIL | VALUE |                      1 | [W]   | COEFF | NIL             |
| Q-N-EN | reactive power  | Q-N-RU | рекативная мощность | U-N-EN | var               | U-N-RU | вар                     | U-S-EN | var  | U-S-RU | вар    | D-SYMB | NIL | VALUE |                      1 | [W]   | COEFF | NIL             |
| Q-N-EN | electric charge | Q-N-RU | электрический заряд | U-N-EN | ampere hour       | U-N-RU | ампер-час               | U-S-EN | A*h  | U-S-RU | А*ч    | D-SYMB | NIL | VALUE |                   3600 | [C]   | COEFF | NIL             |

#+RESULTS:
| Q-N-EN | length           | Q-N-RU | длина              | U-N-EN | nautical mile | U-N-RU | морская миля     | U-S-EN | nmi   | U-S-RU | миля   | D-SYMB | NIL | VALUE |                  1852 | [m]     | COEFF | NIL |
| Q-N-EN | mass             | Q-N-RU | масса              | U-N-EN |               | U-N-RU | карат            | U-S-EN | кар   | U-S-RU | кар    | D-SYMB | NIL | VALUE |                1/5000 | [kg]    | COEFF | NIL |
| Q-N-EN | linear density   | Q-N-RU | линейная плотность | U-N-EN |               | U-N-RU | текс             | U-S-EN | tex   | U-S-RU | текс   | D-SYMB | NIL | VALUE |             1/1000000 | [kg/m]  | COEFF | NIL |
| Q-N-EN | velocity         | Q-N-RU | скорость           | U-N-EN | knot          | U-N-RU | узел             | U-S-EN | kn    | U-S-RU | уз     | D-SYMB | NIL | VALUE |               463/900 | [m*s]   | COEFF | NIL |
| Q-N-EN | acceleration     | Q-N-RU | ускорение          | U-N-EN |               | U-N-RU | гал              | U-S-EN | Gal   | U-S-RU | Гал    | D-SYMB | NIL | VALUE |                 1/100 | [m/s^2] | COEFF | NIL |
| Q-N-EN | rotational speed | Q-N-RU | частота вращения   | U-N-EN |               | U-N-RU | оборот в секунду | U-S-EN | r/s   | U-S-RU | об/с   | D-SYMB | NIL | VALUE |   6.283185307179586d0 | [rad/s] | COEFF | NIL |
| Q-N-EN | rotational speed | Q-N-RU | частота вращения   | U-N-EN |               | U-N-RU | оборот в минуту  | U-S-EN | r/min | U-S-RU | об/мин | D-SYMB | NIL | VALUE | 0.10471975511965977d0 | [rad/s] | COEFF | NIL |
| Q-N-EN | pressure         | Q-N-RU | давление           | U-N-EN |               | U-N-RU | бар              | U-S-EN | bar   | U-S-RU | бар    | D-SYMB | NIL | VALUE |                100000 | [Pa]    | COEFF | NIL |

#+RESULTS:
: #<PACKAGE "MNAS-DIM-VALUE">

#+RESULTS:
: #<PACKAGE "MNAS-DIM-VALUE">

#+BEGIN_SRC lisp :exports results



  mnas-dim-value::*C-0*
  mnas-dim-value::*DIMENSION->NAME*
  mnas-dim-value::*DIMENSION->NAME-RU*
  mnas-dim-value::*DIMENSION->STRING*
  mnas-dim-value::*DIMENSION->STRING-RU*
  mnas-dim-value::*F*
  mnas-dim-value::*MULT-NM-VL*
  mnas-dim-value::*NAME->DIMENSION*
  mnas-dim-value::*NAME->DIMENSION-RU*
  mnas-dim-value::*ND-NOT-SI-UNITS-TBL-05*
  mnas-dim-value::*ND-NOT-SI-UNITS-TBL-07*
  mnas-dim-value::*ND-SI-DERIVED-UNITS-TBL-02*
  mnas-dim-value::*ND-SI-DERIVED-UNITS-TBL-03*
  mnas-dim-value::*ND-SI-DERIVED-UNITS-TBL-04*
  mnas-dim-value::*ND-SI-MAIN-UNITS*
  mnas-dim-value::*NM-VL*
  mnas-dim-value::*NM-VL-EN->RU*
  mnas-dim-value::*NM-VL-RU->EN*
  mnas-dim-value::*NOT-SI-UNITS-TBL-05*
  mnas-dim-value::*NOT-SI-UNITS-TBL-07*
  mnas-dim-value::*R-0*
  mnas-dim-value::*SI-DERIVED-UNITS-TBL-02*
  mnas-dim-value::*SI-DERIVED-UNITS-TBL-03*
  mnas-dim-value::*SI-DERIVED-UNITS-TBL-04*
  mnas-dim-value::*SI-MAIN-UNITS*
  mnas-dim-value::*STRING->DIMENSION*
  mnas-dim-value::*STRING->DIMENSION-RU*
  mnas-dim-value::*V-0*
#+END_SRC

#+RESULTS:
| length | длина              | NIL | nautical mile | морская миля     | nmi   | миля   |                  1852 | m        | NIL |
|        | масса              | NIL |               | карат            | кар   | кар    |                1/5000 | kg       | NIL |
|        | линейная плотность | NIL |               | текс             | tex   | текс   |             1/1000000 | [m^-1kg] | NIL |
|        | скорость           | NIL | knot          | узел             | kn    | уз     |               463/900 | [ms]     | NIL |
|        | ускорение          | NIL |               | гал              | Gal   | Гал    |                 1/100 | m/s^2    | NIL |
|        | частота вращения   | NIL |               | оборот в секунду | r/s   | об/с   |   6.283185307179586d0 | rad/s    | NIL |
|        | частота вращения   | NIL |               | оборот в минуту  | r/min | об/мин | 0.10471975511965977d0 | rad/s    | NIL |
|        | давление           | NIL |               | бар              | bar   | бар    |                100000 | Pa       | NIL |


| "rad"      | 1 rad                       |    |
| "sr"       | 1 sr                        |    |
| "Hz"       | 1 Hz                        |    |
| "N"        | 1 N                         |    |
| "Pa"       | 1 Pa                        |    |
| "J"        | 1 J                         |    |
| "W"        | 1 W                         |    |
| "C"        | 1 C                         |    |
| "V"        | 1 V                         |    |
| "F"        | 1 F                         |    |
| "Ω"        | 1 Ω                         |    |
| "S"        | 1 S                         |    |
| "Wb"       | 1 Wb                        |    |
| "T"        | 1 T                         |    |
| "H"        | 1 H                         |    |
| "°C"       | 1 K                         |    |
| "lm"       | 1 lm                        |    |
| "lx"       | 1 lx                        |    |
| "Bq"       | 1 Hz                        |    |
| "Gy"       | 1 Gy                        |    |
| "Sv"       | 1 Gy                        |    |
| "kat"      | 1 kat                       |    |
| "ul"       | 1 ul                        |    |
| "m"        | 1 m                         |    |
| "g"        | 1/1000 kg                   |    |
| "s"        | 1 s                         |    |
| "A"        | 1 A                         |    |
| "K"        | 1 K                         |    |
| "mol"      | 1 mol                       |    |
| "cd"       | 1 cd                        |    |
| "nmi"      | 1852 m                      |    |
| "кар"      | 1/5000 kg                   | Ru |
| "tex"      | 1/1000000 [kg/m]            |    |
| "kn"       | 463/900 [m*s]               |    |
| "Gal"      | 1/100 m/s^2                 |    |
| "r/s"      | 6.283185307179586d0 rad/s   |    |
| "r/min"    | 0.10471975511965977d0 rad/s |    |
| "bar"      | 100000 Pa                   |    |
| "t"        | 1000 kg                     |    |
| "u"        | 1.66054021d-27 kg           |    |
| "min"      | 60 s                        |    |
| "h"        | 3600 s                      |    |
| "d"        | 86400 s                     |    |
| "°"        | 0.017453292519943295d0 rad  |    |
| "'"        | 2.908882086657216d-4 rad    |    |
| "\""       | 4.84813681109536d-6 rad     |    |
| "gon"      | 0.015707963267948967d0 rad  |    |
| "l"        | 1/1000 m^3                  |    |
| "ua"       | 1.495978706916d11 m         |    |
| "ly"       | 9.4607304725808d15 m        |    |
| "pc"       | 3.0856776d16 m              |    |
| "дптр"     | 1 1/m                       |    |
| "a"        | 100 m^2                     |    |
| "eV"       | 1.60217733d-19 J            |    |
| "kW*h"     | 3600000 J                   |    |
| "V*A"      | 1 W                         |    |
| "var"      | 1 W                         |    |
| "A*h"      | 3600 C                      |    |
| "Å"        | 1.0d-10 m                   |    |
| "b"        | 1.0d-28 m^2                 |    |
| "q"        | 100 kg                      |    |
| "□˚"       | 3.0461741978670857d-4 sr    |    |
| "dyn"      | 1/100000 N                  |    |
| "gf"       | 0.0098065d0 N               |    |
| "p"        | 9.8065d0 N                  |    |
| "tf"       | 9806.5d0 N                  |    |
| "kgf/cm^2" | 98065.0d0 Pa                |    |
| "kp/cm^2"  | 98065.0d0 Pa                |    |
| "m_H2O"    | 9806.65 Pa                  |    |
| "m_Hg"     | 133322.0d0 Pa               |    |
| "Torr"     | 133.322d0 Pa                |    |
| "kgf/mm^2" | 9806500.0d0 Pa              |    |
| "kp/mm^2"  | 9806500.0d0 Pa              |    |
| "erg"      | 1/10000000 J                |    |
| "P"        | 1/10 Pa*s                   |    |
| "St"       | 1/10000 [m^2/s]             |    |
| "cal"      | 4.1868 J                    |    |
| "cal_{th}" | 4.184 J                     |    |
| "cal_{15}" | 4.1855 J                    |    |
| "μ"        | 1/1000000 m                 |    |
| "r"        | 6.283185307179586d0 rad     |    |
| "daa"      | 1000 m^2                    |    |
